{
  "法律咨询": {
    "民事纠纷": [
      "感谢您的咨询！这类民事纠纷确实需要详细了解具体情况，建议私信详细沟通，我可以为您提供专业的法律建议 ⚖️",
      "您提到的情况涉及民法相关条款，建议保留好相关证据。欢迎私信获取更具体的解决方案 📋",
      "这类案件的处理需要考虑多个法律层面，私信我详细情况，我来为您分析最佳的维权路径 💼"
    ],
    "合同纠纷": [
      "合同纠纷的关键在于条款解释和违约责任认定，建议私信发送合同条款，我来为您详细分析 📄",
      "您的情况可能涉及合同法相关规定，建议及时采取法律措施。私信我获取专业建议 ⚖️",
      "合同争议需要专业分析，私信详聊，我可以为您制定详细的解决方案 💡"
    ],
    "劳动争议": [
      "劳动关系问题涉及多项法律保护，建议保留好劳动合同和工资条等证据。私信详谈维权策略 💪",
      "您的情况可能违反劳动法相关规定，建议及时咨询。私信我，为您分析具体的法律途径 📋",
      "劳动争议处理有特定程序，私信我详细情况，我来指导您如何有效维权 ⚖️"
    ],
    "婚姻家庭": [
      "婚姻家庭问题需要综合考虑法律和情理，私信详聊，我来为您提供专业的法律建议 💕",
      "这类家庭纠纷确实复杂，涉及多项法律条款。建议私信沟通，制定合适的解决方案 🏠",
      "家庭法律问题需要谨慎处理，私信我具体情况，我来为您分析最佳的处理方式 👨‍👩‍👧‍👦"
    ],
    "房产纠纷": [
      "房产问题涉及物权法等多项法律，建议保留好相关文件。私信详谈，我来为您分析产权归属 🏡",
      "您的房产纠纷需要专业评估，私信发送相关资料，我来为您制定维权策略 📋",
      "房地产法律关系复杂，私信我详细情况，我来为您分析解决路径 🏢"
    ],
    "交通事故": [
      "交通事故责任认定和赔偿标准有明确规定，私信我事故详情，我来为您分析赔偿方案 🚗",
      "您的交通事故案件需要专业处理，建议及时固定证据。私信详聊赔偿标准 🚦",
      "交通事故理赔涉及多项条款，私信我具体情况，我来为您争取最大权益 💰"
    ]
  },
  "感谢赞扬": [
    "感谢您的认可！🙏 能帮助大家了解法律知识是我的荣幸，有任何法律问题都可以私信咨询",
    "谢谢您的支持！💪 普法路上需要大家的关注，一起学法用法，维护自身权益",
    "感谢点赞！❤️ 法律知识确实很重要，关注我获取更多实用法律资讯",
    "谢谢您的鼓励！✨ 会继续分享更多法律干货，帮助大家避免法律风险"
  ],
  "质疑反驳": [
    "感谢您的不同观点，法律确实有多种解释角度。欢迎私信深入探讨，共同学习进步 🤝",
    "您提出的问题很有价值，法律条文的理解确实需要结合具体情况。私信详聊具体案例 📚",
    "不同的法律观点都值得探讨，这正是法学的魅力所在。欢迎私信交流您的见解 💭",
    "感谢您的专业意见，法律实践中确实会遇到各种复杂情况。私信我们进一步讨论 ⚖️"
  ],
  "普法科普": [
    "这个法律知识点确实很实用！👍 日常生活中经常遇到，大家要注意保护自己的合法权益",
    "感谢关注法律科普！📖 这些知识确实能帮助大家避免很多法律风险",
    "法律就在我们身边，了解这些常识非常必要！💡 有具体问题欢迎私信咨询",
    "普法宣传很重要，让更多人了解法律保护自己 🛡️ 关注我获取更多法律知识"
  ],
  "闲聊互动": [
    "哈哈，谢谢您的互动！😄 虽然是闲聊，但也要注意法律风险哦。有法律问题随时私信",
    "感谢您的关注！😊 平时多了解法律知识，关键时刻能保护自己",
    "您的评论很有趣！😂 生活中处处有法律，有问题记得找专业律师咨询",
    "互动愉快！🎉 法律虽然严肃，但学习过程可以很轻松。有疑问欢迎私信"
  ],
  "引导关注": [
    "更多法律干货内容，记得关注我！🔔 每天分享实用法律知识",
    "喜欢这个内容的话，点个关注吧！👆 后续会有更多法律案例分析",
    "关注我，了解更多法律知识！📱 让法律成为您生活的保护伞",
    "别忘了关注哦！✨ 定期更新法律资讯，助您维权无忧"
  ],
  "私信引导": [
    "具体情况比较复杂，建议私信详细沟通，我来为您制定专业的解决方案 📩",
    "您的问题很有代表性，私信我详细情况，我来做专业分析 💬",
    "这种情况需要了解更多细节，私信我，我来为您提供针对性建议 🔒",
    "涉及个人隐私的法律问题，建议私信咨询，我会为您保密并提供专业建议 🤐"
  ],
  "预约咨询": [
    "您的情况比较复杂，建议预约线下咨询，我来为您提供更全面的法律服务 📅",
    "这类案件需要面对面详细沟通，可以预约咨询时间，我来为您制定维权策略 🕐",
    "建议预约正式咨询，我可以为您提供书面法律意见和完整解决方案 📋",
    "复杂案件建议预约深度咨询，我来为您分析案件前景和最佳策略 ⚖️"
  ]
}
